import React, { useContext } from 'react';
import { LanguageContext } from '../js/context';

export default function Footer() {
  const currentLanguage = useContext(LanguageContext);

  return (
    <div className='footer'>
      <h2 className='footer__title title'>
        {currentLanguage === 'ua' ? 'Наші контакти' : 'Our contacts'}:
      </h2>

      <a className='footer__tel' href='tel:+38(068)130-30-30' rel='noreferrer'>
        <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fillRule="evenodd" clipRule="evenodd" d="M6.23768 4.55868C6.58308 4.09321 6.70693 3.60264 6.31629 3.16962C5.43966 1.94297 4.8501 1.18441 4.4803 0.819106C3.77726 0.124617 2.62074 0.218558 2.01186 0.818513C1.68482 1.14075 1.57411 1.25141 1.23831 1.59249C-0.632123 3.46393 0.508564 7.42008 3.54093 10.4554C6.5726 13.4901 10.5284 14.6314 12.4027 12.756C12.7126 12.4573 12.975 12.1948 13.1819 11.9761C13.7786 11.3454 13.8691 10.2399 13.1779 9.5217C12.8236 9.15349 12.1002 8.59239 10.822 7.67804C10.4305 7.32797 9.96627 7.40384 9.54069 7.68304C9.33598 7.81734 9.18701 7.9532 8.9057 8.23479L8.39487 8.7459C8.32759 8.81322 7.41399 8.35569 6.52714 7.46797C5.63981 6.57977 5.1826 5.66612 5.24956 5.59916L5.76075 5.0877C5.85 4.99836 5.89266 4.95511 5.94739 4.89759C6.06139 4.77778 6.15578 4.66904 6.23768 4.55868ZM9.33716 9.68871L9.84809 9.1775C10.0029 9.02253 10.1032 8.92724 10.1849 8.86154C11.3046 9.66568 11.9531 10.1713 12.218 10.4465C12.3771 10.6118 12.3524 10.9133 12.2141 11.0594C12.0228 11.2617 11.7742 11.5104 11.4692 11.8046C10.2571 13.0172 7.06393 12.0959 4.48342 9.51282C1.9021 6.92896 0.981255 3.73528 2.18413 2.53174C2.51857 2.19207 2.62453 2.08616 2.9469 1.76852C3.06777 1.64942 3.39701 1.62268 3.54405 1.76792C3.82876 2.04917 4.35689 2.72541 5.13381 3.80763C5.09359 3.85757 5.04335 3.914 4.98222 3.97824C4.93735 4.0254 4.89997 4.06329 4.81825 4.14509L4.30757 4.65605C3.43881 5.52475 4.17868 7.00322 5.58465 8.41058C6.98965 9.81696 8.46868 10.5577 9.33716 9.68871Z" fill='black'/>
        </svg>

        +38(068)130-30-30
      </a>

      <a href='https://www.instagram.com/artpatrul.ua/' target='_blank' rel='noreferrer'>
        <svg xmlns="http://www.w3.org/2000/svg"  viewBox="0 0 48 48" width="48px" height="48px"><radialGradient id="yOrnnhliCrdS2gy~4tD8ma" cx="19.38" cy="42.035" r="44.899" gradientUnits="userSpaceOnUse"><stop offset="0" stopColor="#fd5"/><stop offset=".328" stopColor="#ff543f"/><stop offset=".348" stopColor="#fc5245"/><stop offset=".504" stopColor="#e64771"/><stop offset=".643" stopColor="#d53e91"/><stop offset=".761" stopColor="#cc39a4"/><stop offset=".841" stopColor="#c837ab"/></radialGradient><path fill="url(#yOrnnhliCrdS2gy~4tD8ma)" d="M34.017,41.99l-20,0.019c-4.4,0.004-8.003-3.592-8.008-7.992l-0.019-20	c-0.004-4.4,3.592-8.003,7.992-8.008l20-0.019c4.4-0.004,8.003,3.592,8.008,7.992l0.019,20	C42.014,38.383,38.417,41.986,34.017,41.99z"/><radialGradient id="yOrnnhliCrdS2gy~4tD8mb" cx="11.786" cy="5.54" r="29.813" gradientTransform="matrix(1 0 0 .6663 0 1.849)" gradientUnits="userSpaceOnUse"><stop offset="0" stopColor="#4168c9"/><stop offset=".999" stopColor="#4168c9" stopOpacity="0"/></radialGradient><path fill="url(#yOrnnhliCrdS2gy~4tD8mb)" d="M34.017,41.99l-20,0.019c-4.4,0.004-8.003-3.592-8.008-7.992l-0.019-20	c-0.004-4.4,3.592-8.003,7.992-8.008l20-0.019c4.4-0.004,8.003,3.592,8.008,7.992l0.019,20	C42.014,38.383,38.417,41.986,34.017,41.99z"/><path fill="#fff" d="M24,31c-3.859,0-7-3.14-7-7s3.141-7,7-7s7,3.14,7,7S27.859,31,24,31z M24,19c-2.757,0-5,2.243-5,5	s2.243,5,5,5s5-2.243,5-5S26.757,19,24,19z"/><circle cx="31.5" cy="16.5" r="1.5" fill="#fff"/><path fill="#fff" d="M30,37H18c-3.859,0-7-3.14-7-7V18c0-3.86,3.141-7,7-7h12c3.859,0,7,3.14,7,7v12	C37,33.86,33.859,37,30,37z M18,13c-2.757,0-5,2.243-5,5v12c0,2.757,2.243,5,5,5h12c2.757,0,5-2.243,5-5V18c0-2.757-2.243-5-5-5H18z"/></svg>
        @artpatrul.ua
      </a>

      <a href='https://www.instagram.com/zoopatrul.ua/' target='_blank' rel='noreferrer'>
        <svg xmlns="http://www.w3.org/2000/svg"  viewBox="0 0 48 48" width="48px" height="48px"><radialGradient id="yOrnnhliCrdS2gy~4tD8ma" cx="19.38" cy="42.035" r="44.899" gradientUnits="userSpaceOnUse"><stop offset="0" stopColor="#fd5"/><stop offset=".328" stopColor="#ff543f"/><stop offset=".348" stopColor="#fc5245"/><stop offset=".504" stopColor="#e64771"/><stop offset=".643" stopColor="#d53e91"/><stop offset=".761" stopColor="#cc39a4"/><stop offset=".841" stopColor="#c837ab"/></radialGradient><path fill="url(#yOrnnhliCrdS2gy~4tD8ma)" d="M34.017,41.99l-20,0.019c-4.4,0.004-8.003-3.592-8.008-7.992l-0.019-20	c-0.004-4.4,3.592-8.003,7.992-8.008l20-0.019c4.4-0.004,8.003,3.592,8.008,7.992l0.019,20	C42.014,38.383,38.417,41.986,34.017,41.99z"/><radialGradient id="yOrnnhliCrdS2gy~4tD8mb" cx="11.786" cy="5.54" r="29.813" gradientTransform="matrix(1 0 0 .6663 0 1.849)" gradientUnits="userSpaceOnUse"><stop offset="0" stopColor="#4168c9"/><stop offset=".999" stopColor="#4168c9" stopOpacity="0"/></radialGradient><path fill="url(#yOrnnhliCrdS2gy~4tD8mb)" d="M34.017,41.99l-20,0.019c-4.4,0.004-8.003-3.592-8.008-7.992l-0.019-20	c-0.004-4.4,3.592-8.003,7.992-8.008l20-0.019c4.4-0.004,8.003,3.592,8.008,7.992l0.019,20	C42.014,38.383,38.417,41.986,34.017,41.99z"/><path fill="#fff" d="M24,31c-3.859,0-7-3.14-7-7s3.141-7,7-7s7,3.14,7,7S27.859,31,24,31z M24,19c-2.757,0-5,2.243-5,5	s2.243,5,5,5s5-2.243,5-5S26.757,19,24,19z"/><circle cx="31.5" cy="16.5" r="1.5" fill="#fff"/><path fill="#fff" d="M30,37H18c-3.859,0-7-3.14-7-7V18c0-3.86,3.141-7,7-7h12c3.859,0,7,3.14,7,7v12	C37,33.86,33.859,37,30,37z M18,13c-2.757,0-5,2.243-5,5v12c0,2.757,2.243,5,5,5h12c2.757,0,5-2.243,5-5V18c0-2.757-2.243-5-5-5H18z"/></svg>
        @zoopatrul.ua
      </a>

      <a href='https://send.monobank.ua/7Djp2wBgqd' target='_blank' rel='noreferrer'>
        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fillRule="evenodd" clipRule="evenodd" d="M13.1027 2.69607C14.1724 2.17246 15.1056 2 16.5532 2.00002C20.2579 2.01536 23 5.13984 23 9.11988C23 12.1578 21.3062 15.0923 18.1512 17.9299C16.4951 19.4193 14.3807 20.8933 12.8664 21.6775L12 22.1261L11.1336 21.6775C9.61932 20.8933 7.50489 19.4193 5.84884 17.9299C2.69383 15.0923 1 12.1578 1 9.11988C1 5.09727 3.71644 2 7.45455 2C8.85028 2 9.83132 2.18878 10.9218 2.72813C11.3015 2.91592 11.6582 3.13866 11.99 3.39576C12.335 3.12339 12.7066 2.88993 13.1027 2.69607Z" fill='red'/>
          <path fillRule="evenodd" clipRule="evenodd" d="M16.5532 2.00002C15.1056 2 14.1724 2.17246 13.1027 2.69607C12.7066 2.88993 12.335 3.12339 11.99 3.39576C11.6582 3.13866 11.3015 2.91592 10.9218 2.72813C9.83132 2.18878 8.85028 2 7.45455 2C3.71644 2 1 5.09727 1 9.11988C1 12.1578 2.69383 15.0923 5.84884 17.9299C7.50489 19.4193 9.61932 20.8933 11.1336 21.6775L12 22.1261L12.8664 21.6775C14.3807 20.8933 16.4951 19.4193 18.1512 17.9299C21.3062 15.0923 23 12.1578 23 9.11988C23 5.13984 20.2579 2.01536 16.5532 2.00002ZM21 9.11988C21 11.4999 19.5862 13.9493 16.8137 16.4429C15.3022 17.8023 13.359 19.1609 12 19.8737C10.641 19.1609 8.69782 17.8023 7.18628 16.4429C4.41382 13.9493 3 11.4999 3 9.11988C3 6.14772 4.88364 4 7.45455 4C8.56428 4 9.24813 4.13159 10.0351 4.52084C10.5 4.75077 10.9109 5.05437 11.2665 5.43377L12.0023 6.2187L12.7315 5.42755C13.0951 5.03295 13.512 4.72244 13.9819 4.49243C14.7459 4.11849 15.387 4 16.5491 4.00001C19.0882 4.01053 21 6.18896 21 9.11988Z" fill='red'/>
        </svg>

        {currentLanguage === 'ua' ? 'Пожертвувати кошти' : 'Donate money'}
      </a>

      <div className='footer__created'>© Site is created by <a href='https://www.instagram.com/tania_li_ko/' target='_blank' rel='noreferrer'>@tania_li_ko</a> with love</div>
    </div>
  )
}
